---
kind: other
id: Methods.T:Autodesk.Revit.DB.ImageType
source: html/64361e33-8f8e-954c-6744-b84e40d67356.htm
---
# ImageType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.